; ModuleID = '1ptrbfk6qw8plc59'
source_filename = "1ptrbfk6qw8plc59"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::thread::local::fast::Key<core::cell::Cell<(u64, u64)>>" = type { %"std::thread::local::lazy::LazyKeyInner<core::cell::Cell<(u64, u64)>>", i8, [7 x i8] }
%"std::thread::local::lazy::LazyKeyInner<core::cell::Cell<(u64, u64)>>" = type { %"core::cell::UnsafeCell<core::option::Option<core::cell::Cell<(u64, u64)>>>" }
%"core::cell::UnsafeCell<core::option::Option<core::cell::Cell<(u64, u64)>>>" = type { %"core::option::Option<core::cell::Cell<(u64, u64)>>" }
%"core::option::Option<core::cell::Cell<(u64, u64)>>" = type { i64, [2 x i64] }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"[closure@std::thread::Builder::spawn_unchecked_<'_, '_, [closure@src/main.rs:18:19: 18:26], ()>::{closure#1}::{closure#0}]" = type { %"[closure@src/main.rs:18:19: 18:26]" }
%"[closure@src/main.rs:18:19: 18:26]" = type { %"alloc::string::String", ptr, %"alloc::string::String" }
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i64, ptr }, i64 }
%"[closure@std::collections::hash::map::RandomState::new::{closure#0}]" = type {}
%"core::option::Option<core::cell::Cell<(u64, u64)>>::Some" = type { [1 x i64], { i64, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !28, identifier: "92a6918aa13c46decae79150956751bd")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, elements: !19, templateParams: !161, identifier: "9d7fefa8f5ad498128cace66f3e82d41")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !29}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, elements: !26, templateParams: !28, identifier: "b2152e162a226e4cf0ab9723d6970e04")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "sys", scope: !18)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8)
!28 = !{}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !31, file: !2, size: 64, align: 64, elements: !33, templateParams: !28, identifier: "8125963e53fdc1113a498faf9b2025d")
!31 = !DINamespace(name: "result", scope: !32)
!32 = !DINamespace(name: "core", scope: null)
!33 = !{!34}
!34 = !DICompositeType(tag: DW_TAG_variant_part, scope: !30, file: !2, size: 64, align: 64, elements: !35, templateParams: !28, identifier: "fb1bf4f0b0efeb8097e2ad65ff52cb5f", discriminator: !159)
!35 = !{!36, !155}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !34, file: !2, baseType: !37, size: 64, align: 64, extraData: i64 0)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !30, file: !2, size: 64, align: 64, elements: !38, templateParams: !40, identifier: "63134bf8ec6d7b1afff43112a8821d21")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !7, align: 8)
!40 = !{!41, !42}
!41 = !DITemplateTypeParameter(name: "T", type: !7)
!42 = !DITemplateTypeParameter(name: "E", type: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !44, file: !2, size: 64, align: 64, elements: !45, templateParams: !28, identifier: "f5355b235e8ed6d04392735ef6f7c1b1")
!44 = !DINamespace(name: "error", scope: !17)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !43, file: !2, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !48, file: !2, size: 64, align: 64, elements: !49, templateParams: !28, identifier: "981ea97288539e8251427c33a6d8d671")
!48 = !DINamespace(name: "repr_bitpacked", scope: !44)
!49 = !{!50, !57}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !47, file: !2, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !52, file: !2, size: 64, align: 64, elements: !54, templateParams: !56, identifier: "5c1468bc23e27decf0d1d442a66b9139")
!52 = !DINamespace(name: "non_null", scope: !53)
!53 = !DINamespace(name: "ptr", scope: !32)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !51, file: !2, baseType: !6, size: 64, align: 64)
!56 = !{!41}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !47, file: !2, baseType: !58, align: 8)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !60, identifier: "66d042ba541d24a75650a9b2509b281")
!59 = !DINamespace(name: "marker", scope: !32)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "T", type: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !44, file: !2, size: 128, align: 64, elements: !63, templateParams: !28, identifier: "83b9b23b4cc7d9ff9634b29b3a0a9f54")
!63 = !{!64}
!64 = !DICompositeType(tag: DW_TAG_variant_part, scope: !62, file: !2, size: 128, align: 64, elements: !65, templateParams: !28, identifier: "fe846f2f82309925efe3b04e3c4dc466", discriminator: !154)
!65 = !{!66, !132, !136, !150}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !64, file: !2, baseType: !67, size: 128, align: 64, extraData: i64 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !62, file: !2, size: 128, align: 64, elements: !68, templateParams: !71, identifier: "3d456914f162d3b880d06ac591f48203")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !67, file: !2, baseType: !70, size: 32, align: 32, offset: 32)
!70 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "C", type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !44, file: !2, size: 192, align: 64, elements: !75, templateParams: !28, identifier: "3c2c2c424e80f0c1403ec30f1b385ff1")
!75 = !{!76, !121}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !74, file: !2, baseType: !77, size: 8, align: 8, offset: 128)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !44, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !79)
!78 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!80 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!98 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!99 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!100 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!102 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!103 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!104 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!105 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!106 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!107 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!108 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!109 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!110 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!111 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!112 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!113 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!114 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!115 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!116 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!117 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!118 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!119 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!120 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !74, file: !2, baseType: !122, size: 128, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !123, templateParams: !28, identifier: "a9f9d25a87610a531deff72be7c7786")
!123 = !{!124, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !122, file: !2, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !28, identifier: "5258b185261690f151108941016da2aa")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !122, file: !2, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 3, lowerBound: 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !64, file: !2, baseType: !133, size: 128, align: 64, extraData: i64 1)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !62, file: !2, size: 128, align: 64, elements: !134, templateParams: !71, identifier: "8b13892fc5a8ef608f3abc0e5727df78")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !2, baseType: !77, size: 8, align: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !64, file: !2, baseType: !137, size: 128, align: 64, extraData: i64 2)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !62, file: !2, size: 128, align: 64, elements: !138, templateParams: !71, identifier: "e0988137034fb9657f8d4038a95e283")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !2, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !44, file: !2, size: 192, align: 64, elements: !142, templateParams: !28, identifier: "782a7aa2c47ee0f039d2318497f16e0e")
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !141, file: !2, baseType: !77, size: 8, align: 8, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !141, file: !2, baseType: !145, size: 128, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !146, templateParams: !28, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !145, file: !2, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !145, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !64, file: !2, baseType: !151, size: 128, align: 64, extraData: i64 3)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !62, file: !2, size: 128, align: 64, elements: !152, templateParams: !71, identifier: "995ad586ebf702a285794969d6e02d42")
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !151, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !62, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagArtificial)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !34, file: !2, baseType: !156, size: 64, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !30, file: !2, size: 64, align: 64, elements: !157, templateParams: !40, identifier: "7fe120ff1c996138de1a6b305cd178f1")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !156, file: !2, baseType: !43, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !30, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!160 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!161 = !{!162}
!162 = !DITemplateTypeParameter(name: "T", type: !22)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !166, vtableHolder: !173, templateParams: !28, identifier: "d2a24f8d267d2b4681e435628c29906c")
!166 = !{!167, !168, !169, !170, !171, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !165, file: !2, baseType: !6, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !165, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !165, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !165, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !165, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !165, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !174, file: !2, size: 64, align: 64, elements: !176, templateParams: !28, identifier: "30f52ffdbc48cd14ef5e4486d2ffa10e")
!174 = !DINamespace(name: "lang_start", scope: !175)
!175 = !DINamespace(name: "rt", scope: !18)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !173, file: !2, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DISubroutineType(types: !180)
!180 = !{null}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#1}<demo::spawn_user_query::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable}", scope: null, file: !2, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#1}<demo::spawn_user_query::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !189, templateParams: !28, identifier: "a81c3aa30be569ec84002c1167923516")
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !2, baseType: !6, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}<demo::spawn_user_query::{closure_env#0}, ()>", scope: !190, file: !2, size: 640, align: 64, elements: !193, templateParams: !28, identifier: "d748e91dbadf53ab29bb85996e6ff93c")
!190 = !DINamespace(name: "spawn_unchecked_", scope: !191)
!191 = !DINamespace(name: "{impl#0}", scope: !192)
!192 = !DINamespace(name: "thread", scope: !18)
!193 = !{!194, !286, !372, !469}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "their_thread", scope: !189, file: !2, baseType: !195, size: 64, align: 64, offset: 512)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !192, file: !2, size: 64, align: 64, elements: !196, templateParams: !28, identifier: "36b98ab7aceffe97cc63a66d912b15a7")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !195, file: !2, baseType: !198, size: 64, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::Inner>>", scope: !199, file: !2, size: 64, align: 64, elements: !200, templateParams: !284, identifier: "b3cc6fb6751c311cec5d56332b913039")
!199 = !DINamespace(name: "pin", scope: !32)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !2, baseType: !202, size: 64, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !203, file: !2, size: 64, align: 64, elements: !205, templateParams: !278, identifier: "85978ce739aead1f1d215c60f42761ae")
!203 = !DINamespace(name: "sync", scope: !204)
!204 = !DINamespace(name: "alloc", scope: null)
!205 = !{!206, !282}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !202, file: !2, baseType: !207, size: 64, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !52, file: !2, size: 64, align: 64, elements: !208, templateParams: !280, identifier: "248d8bc4ed47c9273c08209ec21ebe79")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !207, file: !2, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !203, file: !2, size: 384, align: 64, elements: !212, templateParams: !278, identifier: "e4252dd0bfadf4ffb4caa155dc65632")
!212 = !{!213, !225, !226}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !211, file: !2, baseType: !214, size: 64, align: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !215, file: !2, size: 64, align: 64, elements: !217, templateParams: !28, identifier: "f38b5c2eedba78901a371b7a3f79dd76")
!215 = !DINamespace(name: "atomic", scope: !216)
!216 = !DINamespace(name: "sync", scope: !32)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !214, file: !2, baseType: !219, size: 64, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !220, file: !2, size: 64, align: 64, elements: !221, templateParams: !223, identifier: "e53de9f4f67d1c5d934e588ebb03b9af")
!220 = !DINamespace(name: "cell", scope: !32)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !219, file: !2, baseType: !9, size: 64, align: 64)
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !9)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !211, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !2, baseType: !227, size: 256, align: 64, offset: 128)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !192, file: !2, size: 256, align: 64, elements: !228, templateParams: !28, identifier: "35f175e0a408b81e9be693a19b1ea2ea")
!228 = !{!229, !253, !262}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !2, baseType: !230, size: 128, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::ffi::c_str::CString>", scope: !231, file: !2, size: 128, align: 64, elements: !232, templateParams: !28, identifier: "1c99ad783446b489222ed7622f82b631")
!231 = !DINamespace(name: "option", scope: !32)
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_variant_part, scope: !230, file: !2, size: 128, align: 64, elements: !234, templateParams: !28, identifier: "3b96d7a1dabf96c4d0c771393fdbdebf", discriminator: !252)
!234 = !{!235, !248}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !233, file: !2, baseType: !236, size: 128, align: 64, extraData: i64 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !230, file: !2, size: 128, align: 64, elements: !28, templateParams: !237, identifier: "e509d61a2b478c03258f2d14f33aa18c")
!237 = !{!238}
!238 = !DITemplateTypeParameter(name: "T", type: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !240, file: !2, size: 128, align: 64, elements: !242, templateParams: !28, identifier: "bacb453795ce9a717d994da3c4a1d01c")
!240 = !DINamespace(name: "c_str", scope: !241)
!241 = !DINamespace(name: "ffi", scope: !204)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !239, file: !2, baseType: !244, size: 128, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !245, templateParams: !28, identifier: "6df1d4b2bd1e09ddda3d29adb42ee129")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !244, file: !2, baseType: !148, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !244, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !233, file: !2, baseType: !249, size: 128, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !230, file: !2, size: 128, align: 64, elements: !250, templateParams: !237, identifier: "b8a7160db3bb14d27d424d04ce405ea3")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !249, file: !2, baseType: !239, size: 128, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !230, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !2, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !192, file: !2, size: 64, align: 64, elements: !255, templateParams: !28, identifier: "99458c53858d4ad2f5f46178bd87f196")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !257, size: 64, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !258, file: !2, size: 64, align: 64, elements: !260, templateParams: !28, identifier: "1e342d34174cba5340c42ef6ead38f3e")
!258 = !DINamespace(name: "nonzero", scope: !259)
!259 = !DINamespace(name: "num", scope: !32)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !257, file: !2, baseType: !160, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !227, file: !2, baseType: !263, size: 32, align: 32, offset: 192)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !264, file: !2, size: 32, align: 32, elements: !267, templateParams: !28, identifier: "35725552070ae961d2b71cf60d56f774")
!264 = !DINamespace(name: "futex", scope: !265)
!265 = !DINamespace(name: "thread_parking", scope: !266)
!266 = !DINamespace(name: "sys_common", scope: !18)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !263, file: !2, baseType: !269, size: 32, align: 32)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !215, file: !2, size: 32, align: 32, elements: !270, templateParams: !28, identifier: "f2ade43b08da647f7eb7005840eb2dc9")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !269, file: !2, baseType: !272, size: 32, align: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !220, file: !2, size: 32, align: 32, elements: !273, templateParams: !276, identifier: "dd054b2c64b97d471668812c78f09a9a")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !2, baseType: !275, size: 32, align: 32)
!275 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!276 = !{!277}
!277 = !DITemplateTypeParameter(name: "T", type: !275)
!278 = !{!279}
!279 = !DITemplateTypeParameter(name: "T", type: !227)
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !211)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !202, file: !2, baseType: !283, align: 8)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !280, identifier: "94ea14a8a1248f7577ec0a73a9842d5c")
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "P", type: !202)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "output_capture", scope: !189, file: !2, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !231, file: !2, size: 64, align: 64, elements: !288, templateParams: !28, identifier: "4645a17b3d025bdd56706774080ba375")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 64, align: 64, elements: !290, templateParams: !28, identifier: "b6a75c637cdb1bd8501a99764fa7a7a3", discriminator: !371)
!290 = !{!291, !367}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !289, file: !2, baseType: !292, size: 64, align: 64, extraData: i64 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 64, align: 64, elements: !28, templateParams: !293, identifier: "de002d6a9b131112a474676aaf76763f")
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "T", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !203, file: !2, size: 64, align: 64, elements: !296, templateParams: !361, identifier: "b3c4d7556a7e3b68e549afd9329c137f")
!296 = !{!297, !365}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !295, file: !2, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !52, file: !2, size: 64, align: 64, elements: !299, templateParams: !363, identifier: "7422a305d8084fbc27da414c2d1f2a4a")
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !298, file: !2, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !302, size: 64, align: 64, dwarfAddressSpace: 0)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !203, file: !2, size: 384, align: 64, elements: !303, templateParams: !361, identifier: "7263e3fb50ad1ac257a812a3db092a2e")
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !302, file: !2, baseType: !214, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !302, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !2, baseType: !307, size: 256, align: 64, offset: 128)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !308, file: !2, size: 256, align: 64, elements: !310, templateParams: !359, identifier: "80a85ba62302c47ceaaa9dad7cf64022")
!308 = !DINamespace(name: "mutex", scope: !309)
!309 = !DINamespace(name: "sync", scope: !18)
!310 = !{!311, !317, !330}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !307, file: !2, baseType: !312, size: 32, align: 32)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !313, file: !2, size: 32, align: 32, elements: !315, templateParams: !28, identifier: "d347f2e65389906c341278eb0faa96c2")
!313 = !DINamespace(name: "futex_mutex", scope: !314)
!314 = !DINamespace(name: "locks", scope: !24)
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !312, file: !2, baseType: !269, size: 32, align: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !307, file: !2, baseType: !318, size: 8, align: 8, offset: 32)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !319, file: !2, size: 8, align: 8, elements: !320, templateParams: !28, identifier: "7951a42d14544fa2c1b059a5e03adca")
!319 = !DINamespace(name: "poison", scope: !309)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !318, file: !2, baseType: !322, size: 8, align: 8)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !215, file: !2, size: 8, align: 8, elements: !323, templateParams: !28, identifier: "a1d4d4f7c4500cf6f9176deff5a8f847")
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !322, file: !2, baseType: !325, size: 8, align: 8)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !220, file: !2, size: 8, align: 8, elements: !326, templateParams: !328, identifier: "1c2f06075d498ce5f824de3d6e9d29e")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !2, baseType: !78, size: 8, align: 8)
!328 = !{!329}
!329 = !DITemplateTypeParameter(name: "T", type: !78)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !2, baseType: !331, size: 192, align: 64, offset: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !220, file: !2, size: 192, align: 64, elements: !332, templateParams: !359, identifier: "55c1ce83dbb05d2834d630faa94ab4fa")
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !331, file: !2, baseType: !334, size: 192, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !335, file: !2, size: 192, align: 64, elements: !336, templateParams: !356, identifier: "55990be4dd46e8ba533d812def835069")
!335 = !DINamespace(name: "vec", scope: !204)
!336 = !{!337, !358}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !334, file: !2, baseType: !338, size: 128, align: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !339, file: !2, size: 128, align: 64, elements: !340, templateParams: !356, identifier: "38511e7cc87429b5a2a2edacb76269f9")
!339 = !DINamespace(name: "raw_vec", scope: !204)
!340 = !{!341, !352, !353}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !338, file: !2, baseType: !342, size: 64, align: 64, offset: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !343, file: !2, size: 64, align: 64, elements: !344, templateParams: !328, identifier: "ce184d0d6dcc22a4dd9897b2d254fd7f")
!343 = !DINamespace(name: "unique", scope: !53)
!344 = !{!345, !350}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !342, file: !2, baseType: !346, size: 64, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !52, file: !2, size: 64, align: 64, elements: !347, templateParams: !328, identifier: "61ec11908fb2b93c794a2832efe8367")
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !346, file: !2, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !342, file: !2, baseType: !351, align: 8)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !328, identifier: "889de1e84d062054c53c41f031af6bb9")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !338, file: !2, baseType: !9, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !338, file: !2, baseType: !354, align: 8)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !355, file: !2, align: 8, elements: !28, identifier: "325d801c241d51bf9fbbd53e77712896")
!355 = !DINamespace(name: "alloc", scope: !204)
!356 = !{!329, !357}
!357 = !DITemplateTypeParameter(name: "A", type: !354)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !334, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "T", type: !334)
!361 = !{!362}
!362 = !DITemplateTypeParameter(name: "T", type: !307)
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "T", type: !302)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !295, file: !2, baseType: !366, align: 8)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !363, identifier: "9e616395a0208f155fee624dd8313257")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !289, file: !2, baseType: !368, size: 64, align: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 64, align: 64, elements: !369, templateParams: !293, identifier: "5b00cb6b9cb54ba88ab19e0aaef2e7aa")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !368, file: !2, baseType: !295, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !189, file: !2, baseType: !373, size: 448, align: 64, offset: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaybeDangling<demo::spawn_user_query::{closure_env#0}>", scope: !190, file: !2, size: 448, align: 64, elements: !374, templateParams: !467, identifier: "fce037f76755483684570475b6d3fda8")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !373, file: !2, baseType: !376, size: 448, align: 64)
!376 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<demo::spawn_user_query::{closure_env#0}>", scope: !377, file: !2, size: 448, align: 64, elements: !379, templateParams: !467, identifier: "e1d27360022f53b8983d5da6e24e4f8f")
!377 = !DINamespace(name: "maybe_uninit", scope: !378)
!378 = !DINamespace(name: "mem", scope: !32)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !376, file: !2, baseType: !7, align: 8)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !376, file: !2, baseType: !382, size: 448, align: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<demo::spawn_user_query::{closure_env#0}>", scope: !383, file: !2, size: 448, align: 64, elements: !384, templateParams: !467, identifier: "aa475f3d30d8f3658adac2258425a768")
!383 = !DINamespace(name: "manually_drop", scope: !378)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !382, file: !2, baseType: !386, size: 448, align: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !387, file: !2, size: 448, align: 64, elements: !389, templateParams: !28, identifier: "5f5fb700b7d38a13adea6d1f8d5b278a")
!387 = !DINamespace(name: "spawn_user_query", scope: !388)
!388 = !DINamespace(name: "demo", scope: null)
!389 = !{!390, !395, !466}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "question", scope: !386, file: !2, baseType: !391, size: 192, align: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !392, file: !2, size: 192, align: 64, elements: !393, templateParams: !28, identifier: "788b27f25b583cd99ca2a2f8e25d54c3")
!392 = !DINamespace(name: "string", scope: !204)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !391, file: !2, baseType: !334, size: 192, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "shared_map", scope: !386, file: !2, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>>", scope: !203, file: !2, size: 64, align: 64, elements: !397, templateParams: !460, identifier: "a47e59f3aecdb9161c4354d784b528ff")
!397 = !{!398, !464}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !396, file: !2, baseType: !399, size: 64, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>>>", scope: !52, file: !2, size: 64, align: 64, elements: !400, templateParams: !462, identifier: "731f91037c9e4def14639f7f36d8d8a8")
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !399, file: !2, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>>", baseType: !403, size: 64, align: 64, dwarfAddressSpace: 0)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>>", scope: !203, file: !2, size: 576, align: 64, elements: !404, templateParams: !460, identifier: "52ab3d9fceafb0665f96b1a24ff8bfd8")
!404 = !{!405, !406, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !403, file: !2, baseType: !214, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !403, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !403, file: !2, baseType: !408, size: 448, align: 64, offset: 128)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>", scope: !308, file: !2, size: 448, align: 64, elements: !409, templateParams: !458, identifier: "7194e8ed25027e2aacd66e5402c0dce6")
!409 = !{!410, !411, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !408, file: !2, baseType: !312, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !408, file: !2, baseType: !318, size: 8, align: 8, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !2, baseType: !413, size: 384, align: 64, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>", scope: !220, file: !2, size: 384, align: 64, elements: !414, templateParams: !458, identifier: "853fde42eac53ae74aa336dd9a0e2dbb")
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !413, file: !2, baseType: !416, size: 384, align: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>", scope: !417, file: !2, size: 384, align: 64, elements: !420, templateParams: !457, identifier: "b81aac92a1ab68d990828f7cf37ec3a9")
!417 = !DINamespace(name: "map", scope: !418)
!418 = !DINamespace(name: "hash", scope: !419)
!419 = !DINamespace(name: "collections", scope: !18)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !2, baseType: !422, size: 384, align: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !423, file: !2, size: 384, align: 64, elements: !425, templateParams: !453, identifier: "d80fb981c277a4cef8e982a6d6a3aff9")
!423 = !DINamespace(name: "map", scope: !424)
!424 = !DINamespace(name: "hashbrown", scope: null)
!425 = !{!426, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !422, file: !2, baseType: !427, size: 128, align: 64, offset: 256)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !417, file: !2, size: 128, align: 64, elements: !428, templateParams: !28, identifier: "a456e8b1058c5fd1fc6d4f06426ee027")
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !427, file: !2, baseType: !160, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !427, file: !2, baseType: !160, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !422, file: !2, baseType: !432, size: 256, align: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::string::String, alloc::string::String), alloc::alloc::Global>", scope: !433, file: !2, size: 256, align: 64, elements: !434, templateParams: !452, identifier: "3f53033ab2f5e634f5afd5b7b97599f3")
!433 = !DINamespace(name: "raw", scope: !424)
!434 = !{!435, !444}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !432, file: !2, baseType: !436, size: 256, align: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTableInner<alloc::alloc::Global>", scope: !433, file: !2, size: 256, align: 64, elements: !437, templateParams: !443, identifier: "30d420c9ea35c12cf16b556461bdd0c8")
!437 = !{!438, !439, !440, !441, !442}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !436, file: !2, baseType: !9, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !436, file: !2, baseType: !346, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !436, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !436, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !436, file: !2, baseType: !354, align: 8)
!443 = !{!357}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !432, file: !2, baseType: !445, align: 8)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::string::String, alloc::string::String)>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !446, identifier: "e51cbe08e48958b0f23fef4ebad0ba7e")
!446 = !{!447}
!447 = !DITemplateTypeParameter(name: "T", type: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::string::String, alloc::string::String)", file: !2, size: 384, align: 64, elements: !449, templateParams: !28, identifier: "65db034d24ef1f6252dacdb6e1b89ae6")
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !448, file: !2, baseType: !391, size: 192, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !448, file: !2, baseType: !391, size: 192, align: 64, offset: 192)
!452 = !{!447, !357}
!453 = !{!454, !455, !456, !357}
!454 = !DITemplateTypeParameter(name: "K", type: !391)
!455 = !DITemplateTypeParameter(name: "V", type: !391)
!456 = !DITemplateTypeParameter(name: "S", type: !427)
!457 = !{!454, !455, !456}
!458 = !{!459}
!459 = !DITemplateTypeParameter(name: "T", type: !416)
!460 = !{!461}
!461 = !DITemplateTypeParameter(name: "T", type: !408)
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "T", type: !403)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !396, file: !2, baseType: !465, align: 8)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !462, identifier: "f2392bf8113162a1690a992761e0b8e0")
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !386, file: !2, baseType: !391, size: 192, align: 64, offset: 256)
!467 = !{!468}
!468 = !DITemplateTypeParameter(name: "T", type: !386)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "their_packet", scope: !189, file: !2, baseType: !470, size: 64, align: 64, offset: 576)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Packet<()>>", scope: !203, file: !2, size: 64, align: 64, elements: !471, templateParams: !580, identifier: "495762609cff57f8fb8bcc45c97b0ae9")
!471 = !{!472, !584}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !470, file: !2, baseType: !473, size: 64, align: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !52, file: !2, size: 64, align: 64, elements: !474, templateParams: !582, identifier: "9fce53e46c026d394011cad3763ab313")
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !473, file: !2, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Packet<()>>", baseType: !477, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Packet<()>>", scope: !203, file: !2, size: 384, align: 64, elements: !478, templateParams: !580, identifier: "718c9984aa0fbb3c83da372dde0a54d8")
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !477, file: !2, baseType: !214, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !477, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !477, file: !2, baseType: !482, size: 256, align: 64, offset: 128)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<()>", scope: !192, file: !2, size: 256, align: 64, elements: !483, templateParams: !56, identifier: "d7b40fe3634d7ba9cd43f495d2d562ff")
!483 = !{!484, !522, !562}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !482, file: !2, baseType: !485, size: 64, align: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::thread::scoped::ScopeData>>", scope: !231, file: !2, size: 64, align: 64, elements: !486, templateParams: !28, identifier: "391830539a1ea80d915547fe3ce0c27")
!486 = !{!487}
!487 = !DICompositeType(tag: DW_TAG_variant_part, scope: !485, file: !2, size: 64, align: 64, elements: !488, templateParams: !28, identifier: "5d05c5ea414083d4837d644b1bad5f2", discriminator: !521)
!488 = !{!489, !517}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !487, file: !2, baseType: !490, size: 64, align: 64, extraData: i64 0)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !485, file: !2, size: 64, align: 64, elements: !28, templateParams: !491, identifier: "4a3ae1fdfa2db1b9f548219d50c87283")
!491 = !{!492}
!492 = !DITemplateTypeParameter(name: "T", type: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::scoped::ScopeData>", scope: !203, file: !2, size: 64, align: 64, elements: !494, templateParams: !511, identifier: "317b099dbe72d637e5db6e99c297c78f")
!494 = !{!495, !515}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !493, file: !2, baseType: !496, size: 64, align: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !52, file: !2, size: 64, align: 64, elements: !497, templateParams: !513, identifier: "9c801e1bbd8d03883bfd17e588fedc8a")
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !496, file: !2, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::scoped::ScopeData>", baseType: !500, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::scoped::ScopeData>", scope: !203, file: !2, size: 320, align: 64, elements: !501, templateParams: !511, identifier: "baf8835192b2c339025fd7ec44b2e0")
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !500, file: !2, baseType: !214, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !500, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !500, file: !2, baseType: !505, size: 192, align: 64, offset: 128)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScopeData", scope: !506, file: !2, size: 192, align: 64, elements: !507, templateParams: !28, identifier: "d30c1f2a22216864bc200b1543e0f7d0")
!506 = !DINamespace(name: "scoped", scope: !192)
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_running_threads", scope: !505, file: !2, baseType: !214, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "a_thread_panicked", scope: !505, file: !2, baseType: !322, size: 8, align: 8, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "main_thread", scope: !505, file: !2, baseType: !195, size: 64, align: 64, offset: 64)
!511 = !{!512}
!512 = !DITemplateTypeParameter(name: "T", type: !505)
!513 = !{!514}
!514 = !DITemplateTypeParameter(name: "T", type: !500)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !493, file: !2, baseType: !516, align: 8)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !513, identifier: "361525311bc4bed5158f41e3aa6206df")
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !487, file: !2, baseType: !518, size: 64, align: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !485, file: !2, size: 64, align: 64, elements: !519, templateParams: !491, identifier: "bd6f22b84186033914931acd18b6d488")
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !518, file: !2, baseType: !493, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, scope: !485, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !482, file: !2, baseType: !523, size: 192, align: 64, offset: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>>", scope: !220, file: !2, size: 192, align: 64, elements: !524, templateParams: !560, identifier: "50b36629e2fce5ebd170d41074ac90e")
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !523, file: !2, baseType: !526, size: 192, align: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>", scope: !231, file: !2, size: 192, align: 64, elements: !527, templateParams: !28, identifier: "c4e2a6d8c665ad4edb7947462cb125d2")
!527 = !{!528}
!528 = !DICompositeType(tag: DW_TAG_variant_part, scope: !526, file: !2, size: 192, align: 64, elements: !529, templateParams: !28, identifier: "eff44a0118b01e894975e130fb402d4a", discriminator: !559)
!529 = !{!530, !555}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !528, file: !2, baseType: !531, size: 192, align: 64, extraData: i64 0)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !526, file: !2, size: 192, align: 64, elements: !28, templateParams: !532, identifier: "74e34dcbc3e7aa374ff606c964a6b334")
!532 = !{!533}
!533 = !DITemplateTypeParameter(name: "T", type: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", scope: !31, file: !2, size: 128, align: 64, elements: !535, templateParams: !28, identifier: "cfd64950b72b353d8197071e90c54c2c")
!535 = !{!536}
!536 = !DICompositeType(tag: DW_TAG_variant_part, scope: !534, file: !2, size: 128, align: 64, elements: !537, templateParams: !28, identifier: "821b92ee0cd29323c4d5e4ad38b3faef", discriminator: !554)
!537 = !{!538, !550}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !536, file: !2, baseType: !539, size: 128, align: 64, extraData: i64 0)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !534, file: !2, size: 128, align: 64, elements: !540, templateParams: !542, identifier: "bc0e7f594b940193b452794b90a29eb7")
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !539, file: !2, baseType: !7, align: 8)
!542 = !{!41, !543}
!543 = !DITemplateTypeParameter(name: "E", type: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !545, templateParams: !28, identifier: "37305c4184cccd6417b13c3215024299")
!545 = !{!546, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !544, file: !2, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64, dwarfAddressSpace: 0)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !28, identifier: "7e65657fa9d2fab60038bedba0d82b1")
!549 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !544, file: !2, baseType: !128, size: 64, align: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !536, file: !2, baseType: !551, size: 128, align: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !534, file: !2, size: 128, align: 64, elements: !552, templateParams: !542, identifier: "7b118b82477f638de96d734773832bc7")
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !551, file: !2, baseType: !544, size: 128, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !528, file: !2, baseType: !556, size: 192, align: 64, extraData: i64 1)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !526, file: !2, size: 192, align: 64, elements: !557, templateParams: !532, identifier: "40610f5f4c72c7074b7e6c8115a66348")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !556, file: !2, baseType: !534, size: 128, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !526, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!560 = !{!561}
!561 = !DITemplateTypeParameter(name: "T", type: !526)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !482, file: !2, baseType: !563, align: 8)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<&std::thread::scoped::ScopeData>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !564, identifier: "275a60eff3b6fc4b806de799e5ed4910")
!564 = !{!565}
!565 = !DITemplateTypeParameter(name: "T", type: !566)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&std::thread::scoped::ScopeData>", scope: !231, file: !2, size: 64, align: 64, elements: !567, templateParams: !28, identifier: "ea3f9264e3339fd8b4ba0c204ffb6ffc")
!567 = !{!568}
!568 = !DICompositeType(tag: DW_TAG_variant_part, scope: !566, file: !2, size: 64, align: 64, elements: !569, templateParams: !28, identifier: "cb017605c0f3c45d44066cfc2f9c543d", discriminator: !579)
!569 = !{!570, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !568, file: !2, baseType: !571, size: 64, align: 64, extraData: i64 0)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !566, file: !2, size: 64, align: 64, elements: !28, templateParams: !572, identifier: "d89cb1df83c870fee76c4ac1c14bb752")
!572 = !{!573}
!573 = !DITemplateTypeParameter(name: "T", type: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::thread::scoped::ScopeData", baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !568, file: !2, baseType: !576, size: 64, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !566, file: !2, size: 64, align: 64, elements: !577, templateParams: !572, identifier: "2fb374f0027fcd5fd56bfc1ea72bdb68")
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !576, file: !2, baseType: !574, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!580 = !{!581}
!581 = !DITemplateTypeParameter(name: "T", type: !482)
!582 = !{!583}
!583 = !DITemplateTypeParameter(name: "T", type: !477)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !470, file: !2, baseType: !585, align: 8)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !582, identifier: "5f50f9b03668906caa6e7fa622a8ef81")
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "<&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !589, vtableHolder: !596, templateParams: !28, identifier: "bc949666c893c0d2ac65850ca591871d")
!589 = !{!590, !591, !592, !593, !594, !595}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !588, file: !2, baseType: !6, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !588, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !588, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !588, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !588, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !600, vtableHolder: !605, templateParams: !28, identifier: "46da07df64f7de737ccc74c455ff21b3")
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !599, file: !2, baseType: !6, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !599, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !606, file: !2, align: 8, elements: !28, identifier: "9782ec62f8015f629c16ee97bc832e01")
!606 = !DINamespace(name: "local", scope: !192)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !610, vtableHolder: !615, templateParams: !28, identifier: "f208fa16b102a6d12447d3ac13f33e19")
!610 = !{!611, !612, !613, !614}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !609, file: !2, baseType: !6, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !609, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !609, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !609, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !240, file: !2, size: 256, align: 64, elements: !616, templateParams: !28, identifier: "95e0ee10a066ee7b6376cc1a6c15a5fb")
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !615, file: !2, baseType: !9, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !615, file: !2, baseType: !334, size: 192, align: 64, offset: 64)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !622, vtableHolder: !43, templateParams: !28, identifier: "1f0e736382cc4c589d2d955cba6d6a3a")
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !621, file: !2, baseType: !6, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !621, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !630, vtableHolder: !635, templateParams: !28, identifier: "839d80889b20247bdc275f011b2bebe2")
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !629, file: !2, baseType: !6, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !629, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>>", scope: !319, file: !2, size: 128, align: 64, elements: !636, templateParams: !647, identifier: "7de47649a486327b7c7a408ae0b5dad")
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !635, file: !2, baseType: !638, size: 128, align: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>", scope: !308, file: !2, size: 128, align: 64, elements: !639, templateParams: !458, identifier: "77c90a6104d8ed9a2599ebaceca64b49")
!639 = !{!640, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !638, file: !2, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<std::collections::hash::map::HashMap<alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>", baseType: !408, size: 64, align: 64, dwarfAddressSpace: 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !638, file: !2, baseType: !643, size: 8, align: 8, offset: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !319, file: !2, size: 8, align: 8, elements: !644, templateParams: !28, identifier: "aaf32eab59754dbba861c342ecbfc965")
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !643, file: !2, baseType: !646, size: 8, align: 8)
!646 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!647 = !{!648}
!648 = !DITemplateTypeParameter(name: "T", type: !638)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "<alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !651, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !652, vtableHolder: !544, templateParams: !28, identifier: "294f2fc154460006e38a36c22b03b7a9")
!652 = !{!653, !654, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !651, file: !2, baseType: !6, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !651, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "<hashbrown::raw::{impl#7}::reserve_rehash::{closure_env#0}<(alloc::string::String, alloc::string::String), alloc::alloc::Global, hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>> as core::ops::function::Fn<(&mut hashbrown::raw::RawTableInner<alloc::alloc::Global>, usize)>>::{vtable}", scope: null, file: !2, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "<hashbrown::raw::{impl#7}::reserve_rehash::{closure_env#0}<(alloc::string::String, alloc::string::String), alloc::alloc::Global, hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>> as core::ops::function::Fn<(&mut hashbrown::raw::RawTableInner<alloc::alloc::Global>, usize)>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !660, vtableHolder: !667, templateParams: !28, identifier: "ce9d4b2e5352e9bee28897520e83c505")
!660 = !{!661, !662, !663, !664, !665, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !659, file: !2, baseType: !6, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !659, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !659, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !659, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !659, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !659, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<(alloc::string::String, alloc::string::String), alloc::alloc::Global, hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>>", scope: !668, file: !2, size: 64, align: 64, elements: !670, templateParams: !28, identifier: "b1acadff842ca1d342fca623da1bb292")
!668 = !DINamespace(name: "reserve_rehash", scope: !669)
!669 = !DINamespace(name: "{impl#7}", scope: !433)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__hasher", scope: !667, file: !2, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>", baseType: !673, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String, std::collections::hash::map::RandomState>", scope: !674, file: !2, size: 64, align: 64, elements: !675, templateParams: !28, identifier: "f9faebe16be00ed50194f9a939bf839")
!674 = !DINamespace(name: "make_hasher", scope: !423)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !673, file: !2, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::collections::hash::map::RandomState", baseType: !427, size: 64, align: 64, dwarfAddressSpace: 0)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "<hashbrown::raw::{impl#7}::find::{closure_env#0}<(alloc::string::String, alloc::string::String), alloc::alloc::Global, hashbrown::map::equivalent_key::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String>> as core::ops::function::FnMut<(usize)>>::{vtable}", scope: null, file: !2, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "<hashbrown::raw::{impl#7}::find::{closure_env#0}<(alloc::string::String, alloc::string::String), alloc::alloc::Global, hashbrown::map::equivalent_key::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String>> as core::ops::function::FnMut<(usize)>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !681, vtableHolder: !687, templateParams: !28, identifier: "51eb8eb43431bfa2ca542c0b9a9a2119")
!681 = !{!682, !683, !684, !685, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !680, file: !2, baseType: !6, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !680, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !680, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !680, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !680, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<(alloc::string::String, alloc::string::String), alloc::alloc::Global, hashbrown::map::equivalent_key::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String>>", scope: !688, file: !2, size: 128, align: 64, elements: !689, templateParams: !28, identifier: "b9472ef00404ef4b98bfd9b54eb4bfe1")
!688 = !DINamespace(name: "find", scope: !669)
!689 = !{!690, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__eq", scope: !687, file: !2, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut hashbrown::map::equivalent_key::{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String>", baseType: !692, size: 64, align: 64, dwarfAddressSpace: 0)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::string::String, alloc::string::String, alloc::string::String>", scope: !693, file: !2, size: 64, align: 64, elements: !694, templateParams: !28, identifier: "dad60d55091ed1229c7c8629cb1793b2")
!693 = !DINamespace(name: "equivalent_key", scope: !423)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !692, file: !2, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !391, size: 64, align: 64, dwarfAddressSpace: 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !687, file: !2, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&hashbrown::raw::RawTable<(alloc::string::String, alloc::string::String), alloc::alloc::Global>", baseType: !432, size: 64, align: 64, dwarfAddressSpace: 0)
!699 = !{i32 7, !"PIC Level", i32 2}
!700 = !{i32 7, !"PIE Level", i32 2}
!701 = !{i32 2, !"RtLibUseGOT", i32 1}
!702 = !{i32 2, !"Dwarf Version", i32 4}
!703 = !{i32 2, !"Debug Info Version", i32 3}
!704 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !705, producer: "clang LLVM (rustc version 1.68.0 (2c8cc3432 2023-03-06))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !706, globals: !817, splitDebugInlining: false)
!705 = !DIFile(filename: "src/main.rs/@/1ptrbfk6qw8plc59", directory: "/home/ubuntu/afg/examples/demo")
!706 = !{!707, !713, !77, !722, !729, !736, !803, !807, !811}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DtorState", scope: !708, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !709)
!708 = !DINamespace(name: "fast", scope: !606)
!709 = !{!710, !711, !712}
!710 = !DIEnumerator(name: "Unregistered", value: 0, isUnsigned: true)
!711 = !DIEnumerator(name: "Registered", value: 1, isUnsigned: true)
!712 = !DIEnumerator(name: "RunningOrHasRun", value: 2, isUnsigned: true)
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !714, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !717)
!714 = !DINamespace(name: "v1", scope: !715)
!715 = !DINamespace(name: "rt", scope: !716)
!716 = !DINamespace(name: "fmt", scope: !32)
!717 = !{!718, !719, !720, !721}
!718 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!719 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!720 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!721 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !215, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !723)
!723 = !{!724, !725, !726, !727, !728}
!724 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!725 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!726 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!727 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!728 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !730, file: !2, baseType: !731, size: 8, align: 8, flags: DIFlagEnumClass, elements: !732)
!730 = !DINamespace(name: "cmp", scope: !32)
!731 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!732 = !{!733, !734, !735}
!733 = !DIEnumerator(name: "Less", value: -1)
!734 = !DIEnumerator(name: "Equal", value: 0)
!735 = !DIEnumerator(name: "Greater", value: 1)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !737, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagEnumClass, elements: !738)
!737 = !DINamespace(name: "alignment", scope: !53)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!739 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!740 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!741 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!742 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!743 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!744 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!745 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!746 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!747 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!748 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!749 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!750 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!751 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!752 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!753 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!754 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!755 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!756 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!757 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!758 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!759 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!760 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!761 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!762 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!763 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!764 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!765 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!766 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!767 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!768 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!769 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!770 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!771 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!772 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!773 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!774 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!775 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!776 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!777 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!778 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!779 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!780 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!781 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!782 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!783 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!784 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!785 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!786 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!787 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!788 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!789 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!790 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!791 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!792 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!793 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!794 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!795 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!796 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!797 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!798 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!799 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!800 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!801 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!802 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fallibility", scope: !433, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !804)
!804 = !{!805, !806}
!805 = !DIEnumerator(name: "Fallible", value: 0, isUnsigned: true)
!806 = !DIEnumerator(name: "Infallible", value: 1, isUnsigned: true)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !339, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !808)
!808 = !{!809, !810}
!809 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!810 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !812, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !813)
!812 = !DINamespace(name: "panicking", scope: !32)
!813 = !{!814, !815, !816}
!814 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!815 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!816 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!817 = !{!0, !163, !181, !586, !597, !607, !619, !627, !649, !657, !678}
!818 = distinct !DISubprogram(name: "drop<demo::spawn_user_query::{closure_env#0}>", linkageName: "_ZN104_$LT$std..thread..Builder..spawn_unchecked_..MaybeDangling$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17haa0fba57e8af1dcfE", scope: !820, file: !819, line: 537, type: !821, scopeLine: 537, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !467, retainedNodes: !824)
!819 = !DIFile(filename: "/rustc/2c8cc343237b8f7d5a3c3703e3a87f2eb2c54a74/library/std/src/thread/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "455cac0dcf7aee8c80538a6f60242748")
!820 = !DINamespace(name: "{impl#1}", scope: !190)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::thread::{impl#0}::spawn_unchecked_::MaybeDangling<demo::spawn_user_query::{closure_env#0}>", baseType: !373, size: 64, align: 64, dwarfAddressSpace: 0)
!824 = !{!825}
!825 = !DILocalVariable(name: "self", arg: 1, scope: !818, file: !819, line: 537, type: !823)
!826 = !DILocation(line: 537, column: 21, scope: !818)
!827 = !DILocation(line: 539, column: 26, scope: !818)
!828 = !DILocation(line: 540, column: 14, scope: !818)
!829 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h9e3befae1e471f27E", scope: !831, file: !830, line: 373, type: !834, scopeLine: 373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !848)
!830 = !DIFile(filename: "/rustc/2c8cc343237b8f7d5a3c3703e3a87f2eb2c54a74/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "afd2e83bc7b2acdd8fe6c036dd45a95e")
!831 = !DINamespace(name: "{impl#4}", scope: !832)
!832 = !DINamespace(name: "index", scope: !833)
!833 = !DINamespace(name: "slice", scope: !32)
!834 = !DISubroutineType(types: !835)
!835 = !{!836, !840, !836}
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !837, templateParams: !28, identifier: "2081d302591cc0e6b89f57ab75a79c1e")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !836, file: !2, baseType: !148, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !836, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !841, file: !2, size: 128, align: 64, elements: !843, templateParams: !846, identifier: "c6d1af49db4d4fbf7aad55b481e27aa4")
!841 = !DINamespace(name: "range", scope: !842)
!842 = !DINamespace(name: "ops", scope: !32)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !840, file: !2, baseType: !9, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !840, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!846 = !{!847}
!847 = !DITemplateTypeParameter(name: "Idx", type: !9)
!848 = !{!849, !850, !851}
!849 = !DILocalVariable(name: "self", arg: 1, scope: !829, file: !830, line: 373, type: !840)
!850 = !DILocalVariable(name: "slice", arg: 2, scope: !829, file: !830, line: 373, type: !836)
!851 = !DILocalVariable(name: "this", scope: !852, file: !830, line: 374, type: !840, align: 8)
!852 = distinct !DILexicalBlock(scope: !829, file: !830, line: 374, column: 9)
!853 = !DILocation(line: 373, column: 29, scope: !829)
!854 = !DILocation(line: 373, column: 35, scope: !829)
!855 = !DILocation(line: 386, column: 39, scope: !852)
!856 = !DILocalVariable(name: "self", scope: !857, file: !858, line: 1649, type: !836, align: 8)
!857 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$6as_ptr17h1f6f0bc896b1a30bE", scope: !859, file: !858, line: 1649, type: !861, scopeLine: 1649, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !863)
!858 = !DIFile(filename: "/rustc/2c8cc343237b8f7d5a3c3703e3a87f2eb2c54a74/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "63199579489029b022a28049c721f9e7")
!859 = !DINamespace(name: "{impl#1}", scope: !860)
!860 = !DINamespace(name: "const_ptr", scope: !53)
!861 = !DISubroutineType(types: !862)
!862 = !{!349, !836}
!863 = !{!856}
!864 = !DILocation(line: 1649, column: 25, scope: !857, inlinedAt: !865)
!865 = !DILocation(line: 386, column: 45, scope: !852)
!866 = !DILocation(line: 1650, column: 9, scope: !857, inlinedAt: !865)
!867 = !DILocalVariable(name: "self", scope: !868, file: !858, line: 927, type: !349, align: 8)
!868 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hf3d58b3463f2f8f4E", scope: !869, file: !858, line: 927, type: !870, scopeLine: 927, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !872)
!869 = !DINamespace(name: "{impl#0}", scope: !860)
!870 = !DISubroutineType(types: !871)
!871 = !{!349, !349, !9}
!872 = !{!867, !873}
!873 = !DILocalVariable(name: "count", scope: !868, file: !858, line: 927, type: !9, align: 8)
!874 = !DILocation(line: 927, column: 29, scope: !868, inlinedAt: !875)
!875 = !DILocation(line: 386, column: 54, scope: !852)
!876 = !DILocation(line: 386, column: 58, scope: !852)
!877 = !DILocation(line: 927, column: 35, scope: !868, inlinedAt: !875)
!878 = !DILocation(line: 932, column: 18, scope: !868, inlinedAt: !875)
!879 = !DILocalVariable(name: "self", scope: !880, file: !858, line: 468, type: !349, align: 8)
!880 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h852cec6343689a69E", scope: !869, file: !858, line: 468, type: !881, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !884)
!881 = !DISubroutineType(types: !882)
!882 = !{!349, !349, !883}
!883 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!884 = !{!879, !885}
!885 = !DILocalVariable(name: "count", scope: !880, file: !858, line: 468, type: !883, align: 8)
!886 = !DILocation(line: 468, column: 32, scope: !880, inlinedAt: !887)
!887 = !DILocation(line: 932, column: 23, scope: !868, inlinedAt: !875)
!888 = !DILocation(line: 932, column: 30, scope: !868, inlinedAt: !875)
!889 = !DILocation(line: 468, column: 38, scope: !880, inlinedAt: !887)
!890 = !DILocation(line: 473, column: 18, scope: !880, inlinedAt: !887)
!891 = !DILocalVariable(name: "data", scope: !892, file: !893, line: 733, type: !349, align: 8)
!892 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h041582d5816c73cfE", scope: !53, file: !893, line: 733, type: !894, scopeLine: 733, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !896)
!893 = !DIFile(filename: "/rustc/2c8cc343237b8f7d5a3c3703e3a87f2eb2c54a74/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!894 = !DISubroutineType(types: !895)
!895 = !{!836, !349, !9}
!896 = !{!891, !897}
!897 = !DILocalVariable(name: "len", scope: !892, file: !893, line: 733, type: !9, align: 8)
!898 = !DILocation(line: 733, column: 38, scope: !892, inlinedAt: !899)
!899 = !DILocation(line: 386, column: 13, scope: !852)
!900 = !DILocation(line: 386, column: 71, scope: !852)
!901 = !DILocation(line: 733, column: 54, scope: !892, inlinedAt: !899)
!902 = !DILocation(line: 734, column: 20, scope: !892, inlinedAt: !899)
!903 = !DILocalVariable(name: "self", scope: !904, file: !858, line: 60, type: !349, align: 8)
!904 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17ha45d04e5fc26467eE", scope: !869, file: !858, line: 60, type: !905, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !908, retainedNodes: !907)
!905 = !DISubroutineType(types: !906)
!906 = !{!6, !349}
!907 = !{!903}
!908 = !{!329, !909}
!909 = !DITemplateTypeParameter(name: "U", type: !7)
!910 = !DILocation(line: 60, column: 26, scope: !904, inlinedAt: !911)
!911 = !DILocation(line: 734, column: 25, scope: !892, inlinedAt: !899)
!912 = !DILocation(line: 61, column: 9, scope: !904, inlinedAt: !911)
!913 = !DILocalVariable(name: "data_address", scope: !914, file: !915, line: 112, type: !6, align: 8)
!914 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h0246738dbafa7b1cE", scope: !916, file: !915, line: 111, type: !917, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !919)
!915 = !DIFile(filename: "/rustc/2c8cc343237b8f7d5a3c3703e3a87f2eb2c54a74/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "1e1a461bde75de7a93357ca7e628f393")
!916 = !DINamespace(name: "metadata", scope: !53)
!917 = !DISubroutineType(types: !918)
!918 = !{!836, !6, !9}
!919 = !{!913, !920}
!920 = !DILocalVariable(name: "metadata", scope: !914, file: !915, line: 113, type: !9, align: 8)
!921 = !DILocation(line: 112, column: 5, scope: !914, inlinedAt: !922)
!922 = !DILocation(line: 734, column: 5, scope: !892, inlinedAt: !899)
!923 = !DILocation(line: 734, column: 33, scope: !892, inlinedAt: !899)
!924 = !DILocation(line: 113, column: 5, scope: !914, inlinedAt: !922)
!925 = !DILocation(line: 118, column: 36, scope: !914, inlinedAt: !922)
!926 = !DILocation(line: 118, column: 14, scope: !914, inlinedAt: !922)
!927 = !DILocation(line: 388, column: 6, scope: !829)
!928 = distinct !DISubprogram(name: "get_unchecked_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17hec0e57819dc042caE", scope: !831, file: !830, line: 391, type: !929, scopeLine: 391, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !704, templateParams: !328, retainedNodes: !935)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !840, !931}
